KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32U031.svd
          <register>
            <name>EXTI_EMR2</name>
            <displayName>EXTI_EMR2</displayName>
            <description>EXTI CPU wake-up with event mask register</description>
            <addressOffset>0x094</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EM32</name>
                <description>CPU wake-up with event generation mask on line x, (x1=1371to132)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM33</name>
                <description>CPU wake-up with event generation mask on line x, (x1=1371to132)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM34</name>
                <description>CPU wake-up with event generation mask on line x, (x1=1371to132)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM35</name>
                <description>CPU wake-up with event generation mask on line x, (x1=1371to132)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM36</name>
                <description>CPU wake-up with event generation mask on line x, (x1=1371to132)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EM37</name>
                <description>CPU wake-up with event generation mask on line x, (x1=1371to132)
Setting/clearing each bit unmasks/masks the CPU wake-up with event generation on the corresponding line.
Bit IM36 is available only on STM32U0x3xx devices, it is reserved on STM32U031xx devices.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>wake-up with event generation masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>wake-up with event generation unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
