KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32U031.svd
			<register>
			  <name>TIM2_DCR</name>
			  <displayName>TIM2_DCR</displayName>
			  <description>TIM2 DMA control register</description>
			  <addressOffset>0x48</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>DBA</name>
				  <description>DMA base address
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIMx_CR1</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>TIMx_CR2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>TIMx_SMCR</description>
					  <value>0x2</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DBL</name>
				  <description>DMA burst length
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>1 transfer,</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>2 transfers,</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>3 transfers,</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x11</name>
					  <description>18 transfers.</description>
					  <value>0x11</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_DMAR</name>
			  <displayName>TIM2_DMAR</displayName>
			  <description>TIM2 DMA address for full transfer</description>
			  <addressOffset>0x4C</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>DMAB</name>
				  <description>DMA register for burst accesses
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_OR1</name>
			  <displayName>TIM2_OR1</displayName>
			  <description>TIM2 option register 1</description>
			  <addressOffset>0x50</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>OCREF_CLR</name>
				  <description>Ocref_clr source selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>COMP1 output is connected to the OCREF_CLR input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP2 output is connected to the OCREF_CLR input</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_AF1</name>
			  <displayName>TIM2_AF1</displayName>
			  <description>TIM2 alternate function option register 1</description>
			  <addressOffset>0x60</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>ETRSEL</name>
				  <description>ETR source selection
	</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ETR legacy mode</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP1</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>COMP2</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>LSE</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>MCO</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>MCO2</description>
					  <value>0x5</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM2_TISEL</name>
			  <displayName>TIM2_TISEL</displayName>
			  <description>TIM2 timer input selection register</description>
			  <addressOffset>0x68</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>TI1SEL</name>
				  <description>TI1[0] to TI1[15] input selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIM2_CH1 input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP1 output</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>TI2SEL</name>
				  <description>TI2[0] to TI2[15] input selection
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIM2_CH2 input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP2 output</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>TI3SEL</name>
				  <description>TI3[0] to TI3[15] input selection
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIM2_CH3 input</description>
					  <value>0x0</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
