KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32U031.svd
		  </registers>
      </peripheral>
      <peripheral>
		  <name>TIM3</name>
		  <description>TIM3 address block description</description>
		  <groupName>TIM3</groupName>
		  <baseAddress>0x40000400</baseAddress>
		  <addressBlock>
			<offset>0x0</offset>
			<size>0x6C</size>
			<usage>registers</usage>
		  </addressBlock>
		  <interrupt>
			<name>TIM3</name>
			<description>TIM3 global interrupt</description>
			<value>16</value>
		  </interrupt>
		  <registers>
			<register>
			  <name>TIM3_CR1</name>
			  <displayName>TIM3_CR1</displayName>
			  <description>TIM3 control register 1</description>
			  <addressOffset>0x00</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>CEN</name>
				  <description>Counter enable
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Counter disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Counter enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>UDIS</name>
				  <description>Update disable
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>UEV enabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>UEV disabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>URS</name>
				  <description>Update request source
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Any of the following events generate an update interrupt or DMA request if enabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Only counter overflow/underflow generates an update interrupt or DMA request if enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OPM</name>
				  <description>One-pulse mode</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Counter is not stopped at update event</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Counter stops counting at the next update event (clearing the bit CEN)</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DIR</name>
				  <description>Direction
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Counter used as upcounter</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Counter used as downcounter</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CMS</name>
				  <description>Center-aligned mode selection
	</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Edge-aligned mode.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Center-aligned mode 1.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Center-aligned mode 2.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Center-aligned mode 3.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ARPE</name>
				  <description>Auto-reload preload enable</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIMx_ARR register is not buffered</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>TIMx_ARR register is buffered</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CKD</name>
				  <description>Clock division
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>B_0x0</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>B_0x1</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>B_0x2</description>
					  <value>0x2</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>UIFREMAP</name>
				  <description>UIF status bit remapping</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No remapping.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Remapping enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM3_CR2</name>
			  <displayName>TIM3_CR2</displayName>
			  <description>TIM3 control register 2</description>
			  <addressOffset>0x04</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>CCDS</name>
				  <description>Capture/compare DMA selection</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CCx DMA request sent when CCx event occurs</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CCx DMA requests sent when update event occurs</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>MMS</name>
				  <description>Master mode selection
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Reset - the UG bit from the TIMx_EGR register is used as trigger output (TRGO).</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Enable - the Counter enable signal, CNT_EN, is used as trigger output (TRGO).</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Update - The update event is selected as trigger output (TRGO).</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Compare Pulse - The trigger output send a positive pulse when the CC1IF flag is to be set (even if it was already high), as soon as a capture or a compare match occurred.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>Compare - OC1REFC signal is used as trigger output (TRGO)</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>Compare - OC2REFC signal is used as trigger output (TRGO)</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>Compare - OC3REFC signal is used as trigger output (TRGO)</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>Compare - OC4REFC signal is used as trigger output (TRGO)</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>TI1S</name>
				  <description>TI1 selection</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>The TIMx_CH1 pin is connected to TI1 input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>The TIMx_CH1, CH2 and CH3 pins are connected to the TI1 input (XOR combination) See also Section23.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM3_SMCR</name>
			  <displayName>TIM3_SMCR</displayName>
			  <description>TIM3 slave mode control register</description>
			  <addressOffset>0x08</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>SMS</name>
				  <description>SMS[2:0]: Slave mode selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Slave mode disabled - if CEN = 1 then the prescaler is clocked directly by the internal clock.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Encoder mode 1 - Counter counts up/down on TI1FP1 edge depending on TI2FP2 level.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Encoder mode 2 - Counter counts up/down on TI2FP2 edge depending on TI1FP1 level.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Encoder mode 3 - Counter counts up/down on both TI1FP1 and TI2FP2 edges depending on the level of the other input.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>Reset Mode - Rising edge of the selected trigger input (TRGI) reinitializes the counter and generates an update of the registers.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>Gated Mode - The counter clock is enabled when the trigger input (TRGI) is high.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>Trigger Mode - The counter starts at a rising edge of the trigger TRGI (but it is not reset).</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>External Clock Mode 1 - Rising edges of the selected trigger (TRGI) clock the counter.</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OCCS</name>
				  <description>OCREF clear selection
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>OCREF_CLR_INT is connected to COMP1 or COMP2 output depending on TIMx_OR1.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>OCREF_CLR_INT is connected to ETRF</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>TS</name>
				  <description>TS[2:0]: Trigger selection
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Internal Trigger 0 (ITR0)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Internal Trigger 1 (ITR1)</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Internal Trigger 2 (ITR2)</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Internal Trigger 3 (ITR3)</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>TI1 Edge Detector (TI1F_ED)</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>Filtered Timer Input 1 (TI1FP1)</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>Filtered Timer Input 2 (TI2FP2)</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>External Trigger input (ETRF)</description>
					  <value>0x7</value>
					</enumeratedValue>					
				  </enumeratedValues>
				</field>
				<field>
				  <name>MSM</name>
				  <description>Master/Slave mode</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No action</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>The effect of an event on the trigger input (TRGI) is delayed to allow a perfect synchronization between the current timer and its slaves (through TRGO).</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ETF</name>
				  <description>External trigger filter
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No filter, sampling is done at fless thansub&gt;DTSless than/sub&gt;</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=4</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=8</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/2, N=6</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/2, N=8</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/4, N=6</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/4, N=8</description>
					  <value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x8</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/8, N=6</description>
					  <value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x9</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/8, N=8</description>
					  <value>0x9</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xA</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=5</description>
					  <value>0xA</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xB</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=6</description>
					  <value>0xB</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xC</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=8</description>
					  <value>0xC</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xD</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=5</description>
					  <value>0xD</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xE</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=6</description>
					  <value>0xE</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xF</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=8</description>
					  <value>0xF</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ETPS</name>
				  <description>External trigger prescaler
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Prescaler OFF</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ETRP frequency divided by 2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>ETRP frequency divided by 4</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>ETRP frequency divided by 8</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ECE</name>
				  <description>External clock enable
	</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>External clock mode 2 disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>External clock mode 2 enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ETP</name>
				  <description>External trigger polarity
	</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ETR is non-inverted, active at high level or rising edge</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ETR is inverted, active at low level or falling edge</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>SMS_1</name>
				  <description>SMS[3]</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>TS_1</name>
				  <description>TS[4:3]</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
