KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32U031.svd
			<register>
			  <name>TIM15_SR</name>
			  <displayName>TIM15_SR</displayName>
			  <description>TIM15 status register</description>
			  <addressOffset>0x10</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>UIF</name>
				  <description>Update interrupt flag
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No update occurred.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Update interrupt pending.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC1IF</name>
				  <description>Capture/Compare 1 interrupt flag
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No compare match / No input capture occurred</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>A compare match or an input capture occurred</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC2IF</name>
				  <description>Capture/Compare 2 interrupt flag
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>COMIF</name>
				  <description>COM interrupt flag
	</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No COM event occurred</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COM interrupt pending</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>TIF</name>
				  <description>Trigger interrupt flag
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No trigger event occurred</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Trigger interrupt pending</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BIF</name>
				  <description>Break interrupt flag
	</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No break event occurred</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>An active level has been detected on the break input</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC1OF</name>
				  <description>Capture/Compare 1 overcapture flag
	</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No overcapture has been detected</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>The counter value has been captured in TIMx_CCR1 register while CC1IF flag was already set</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC2OF</name>
				  <description>Capture/Compare 2 overcapture flag
	</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM15_EGR</name>
			  <displayName>TIM15_EGR</displayName>
			  <description>TIM15 event generation register</description>
			  <addressOffset>0x14</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>UG</name>
				  <description>Update generation
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No action</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Reinitialize the counter and generates an update of the registers.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC1G</name>
				  <description>Capture/Compare 1 generation
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No action</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>A capture/compare event is generated on channel 1:</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC2G</name>
				  <description>Capture/Compare 2 generation
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				</field>
				<field>
				  <name>COMG</name>
				  <description>Capture/Compare control update generation
	</description>
				  <bitOffset>5</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No action</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>When the CCPC bit is set, it is possible to update the CCxE, CCxNE and OCxM bits</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>TG</name>
				  <description>Trigger generation
	</description>
				  <bitOffset>6</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No action</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>The TIF flag is set in TIMx_SR register.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BG</name>
				  <description>Break generation
	</description>
				  <bitOffset>7</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>write-only</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No action</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>A break event is generated.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM15_CCMR1</name>
			  <displayName>TIM15_CCMR1</displayName>
			  <description>TIM15 capture/compare mode register 1</description>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CC1S</name>
				  <description>Capture/Compare 1 Selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC1 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TI1</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TI2</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>IC1PSC</name>
				  <description>Input capture 1 prescaler
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>no prescaler, capture is done each time an edge is detected on the capture input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>capture is done once every 2 events</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>capture is done once every 4 events</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>capture is done once every 8 events</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>IC1F</name>
				  <description>Input capture 1 filter
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No filter, sampling is done at fless thansub&gt;DTSless than/sub&gt;</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=4</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=8</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/2, N=6</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/2, N=8</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/4, N=6</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/4, N=8</description>
					  <value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x8</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/8, N=6</description>
					  <value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x9</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/8, N=8</description>
					  <value>0x9</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xA</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=5</description>
					  <value>0xA</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xB</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=6</description>
					  <value>0xB</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xC</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=8</description>
					  <value>0xC</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xD</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=5</description>
					  <value>0xD</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xE</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=6</description>
					  <value>0xE</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xF</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=8</description>
					  <value>0xF</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC2S</name>
				  <description>Capture/Compare 2 selection
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC2 channel is configured as output</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TI2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TI1</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>IC2PSC</name>
				  <description>Input capture 2 prescaler</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>IC2F</name>
				  <description>Input capture 2 filter</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM15_CCMR1_ALTERNATE1</name>
			  <displayName>TIM15_CCMR1_ALTERNATE1</displayName>
			  <description>TIM15 capture/compare mode register 1</description>
			  <alternateRegister>TIM15_CCMR1</alternateRegister>
			  <addressOffset>0x18</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>CC1S</name>
				  <description>Capture/Compare 1 selection
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC1 channel is configured as output.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TI1.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TI2.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC1 channel is configured as input, IC1 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1FE</name>
				  <description>Output Compare 1 fast enable
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC1 behaves normally depending on counter and CCR1 values even when the trigger is ON.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>An active edge on the trigger input acts like a compare match on CC1 output.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1PE</name>
				  <description>Output Compare 1 preload enable
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Preload register on TIMx_CCR1 disabled.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Preload register on TIMx_CCR1 enabled.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC1M</name>
				  <description>OC1M[2:0]: Output Compare 1 mode
	</description>
				  <bitOffset>4</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Frozen - The comparison between the output compare register TIMx_CCR1 and the counter TIMx_CNT has no effect on the outputs.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Set channel 1 to active level on match.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Set channel 1 to inactive level on match.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Toggle - OC1REF toggles when TIMx_CNT=TIMx_CCR1.</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>Force inactive level - OC1REF is forced low.</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>Force active level - OC1REF is forced high.</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>PWM mode 1 - Channel 1 is active as long as TIMx_CNTless thanTIMx_CCR1 else inactive.</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>PWM mode 2 - Channel 1 is inactive as long as TIMx_CNTless thanTIMx_CCR1 else active.</description>
					  <value>0x7</value>
					</enumeratedValue>					
				  </enumeratedValues>
				</field>
				<field>
				  <name>CC2S</name>
				  <description>Capture/Compare 2 selection
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>CC2 channel is configured as output.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TI2.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TI1.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>CC2 channel is configured as input, IC2 is mapped on TRC.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OC2FE</name>
				  <description>Output Compare 2 fast enable</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2PE</name>
				  <description>Output Compare 2 preload enable</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2M</name>
				  <description>OC2M[2:0]: Output Compare 2 mode</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC1M_1</name>
				  <description>OC1M[3]</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>OC2M_1</name>
				  <description>OC2M[3]</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
