KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32U031.svd
			<register>
			  <name>TIM16_BDTR</name>
			  <displayName>TIM16_BDTR</displayName>
			  <description>TIM16 break and dead-time register</description>
			  <addressOffset>0x44</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>DTG</name>
				  <description>Dead-time generator setup
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>8</bitWidth>
				  <access>read-write</access>
				</field>
				<field>
				  <name>LOCK</name>
				  <description>Lock configuration
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>LOCK OFF - No bit is write protected</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>LOCK Level 1 = DTG bits in TIMx_BDTR register, OISx and OISxN bits in TIMx_CR2 register and BKE/BKP/AOE bits in TIMx_BDTR register can no longer be written.</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>LOCK Level 2 = LOCK Level 1 + CC Polarity bits (CCxP/CCxNP bits in TIMx_CCER register, as long as the related channel is configured in output through the CCxS bits) as well as OSSR and OSSI bits can no longer be written.</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>LOCK Level 3 = LOCK Level 2 + CC Control bits (OCxM and OCxPE bits in TIMx_CCMRx registers, as long as the related channel is configured in output through the CCxS bits) can no longer be written.</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OSSI</name>
				  <description>Off-state selection for Idle mode
	</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>When inactive, OC/OCN outputs are disabled (OC/OCN enable output signal=0)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>When inactive, OC/OCN outputs are forced first with their idle level as soon as CCxE=1 or CCxNE=1.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OSSR</name>
				  <description>Off-state selection for Run mode
	</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>When inactive, OC/OCN outputs are disabled (the timer releases the output control which is taken over by the GPIO, which forces a Hi-Z state)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>When inactive, OC/OCN outputs are enabled with their inactive level as soon as CCxE=1 or CCxNE=1 (the output is still controlled by the timer).</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKE</name>
				  <description>Break enable
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Break inputs (BRK and CCS clock failure event) disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKP</name>
				  <description>Break polarity
	</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Break input BRK is active low</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Break input BRK is active high</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AOE</name>
				  <description>Automatic output enable
	</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>MOE can be set only by software</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>MOE can be set by software or automatically at the next update event (if the break input is not be active)</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>MOE</name>
				  <description>Main output enable
	</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>OC and OCN outputs are disabled or forced to idle state depending on the OSSI bit.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKF</name>
				  <description>Break filter
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>No filter, BRK acts asynchronously</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=2</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=4</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;CK_INTless than/sub&gt;, N=8</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/2, N=6</description>
					  <value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x5</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/2, N=8</description>
					  <value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x6</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/4, N=6</description>
					  <value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/4, N=8</description>
					  <value>0x7</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x8</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/8, N=6</description>
					  <value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x9</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/8, N=8</description>
					  <value>0x9</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xA</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=5</description>
					  <value>0xA</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xB</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=6</description>
					  <value>0xB</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xC</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/16, N=8</description>
					  <value>0xC</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xD</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=5</description>
					  <value>0xD</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xE</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=6</description>
					  <value>0xE</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0xF</name>
					  <description>fless thansub&gt;SAMPLINGless than/sub&gt;=fless thansub&gt;DTSless than/sub&gt;/32, N=8</description>
					  <value>0xF</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKDSRM</name>
				  <description>Break Disarm
	</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Break input BRK is armed</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Break input BRK is disarmed</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKBID</name>
				  <description>Break Bidirectional
	</description>
				  <bitOffset>28</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Break input BRK in input mode</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Break input BRK in bidirectional mode</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM16_DCR</name>
			  <displayName>TIM16_DCR</displayName>
			  <description>TIM16 DMA control register</description>
			  <addressOffset>0x48</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>DBA</name>
				  <description>DMA base address
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIMx_CR1,</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>TIMx_CR2,</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>TIMx_SMCR,</description>
					  <value>0x2</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DBL</name>
				  <description>DMA burst length
	</description>
				  <bitOffset>8</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>1 transfer,</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>2 transfers,</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>3 transfers,</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x11</name>
					  <description>18 transfers.</description>
					  <value>0x11</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM16_DMAR</name>
			  <displayName>TIM16_DMAR</displayName>
			  <description>TIM16 DMA address for full transfer</description>
			  <addressOffset>0x4C</addressOffset>
			  <size>16</size>
			  <access>read-write</access>
			  <resetValue>0x0000</resetValue>
			  <resetMask>0xFFFF</resetMask>
			  <fields>
				<field>
				  <name>DMAB</name>
				  <description>DMA register for burst accesses
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>16</bitWidth>
				  <access>read-write</access>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM16_AF1</name>
			  <displayName>TIM16_AF1</displayName>
			  <description>TIM16 alternate function register 1</description>
			  <addressOffset>0x60</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000001</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>BKINE</name>
				  <description>BRK BKIN input enable
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>BKIN input disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>BKIN input enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKCMP1E</name>
				  <description>BRK COMP1 enable
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>COMP1 input disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP1 input enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKCMP2E</name>
				  <description>BRK COMP2 enable
	</description>
				  <bitOffset>2</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>COMP2 input disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP2 input enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKINP</name>
				  <description>BRK BKIN input polarity
	</description>
				  <bitOffset>9</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>BKIN input is active low</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>BKIN input is active high</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKCMP1P</name>
				  <description>BRK COMP1 input polarity
	</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>COMP1 input is active low</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP1 input is active high</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>BKCMP2P</name>
				  <description>BRK COMP2 input polarity
	</description>
				  <bitOffset>11</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>COMP2 input is active low</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>COMP2 input is active high</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
			<register>
			  <name>TIM16_TISEL</name>
			  <displayName>TIM16_TISEL</displayName>
			  <description>TIM16 input selection register</description>
			  <addressOffset>0x68</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x00000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>TI1SEL</name>
				  <description>selects TI1[0] to TI1[15] input
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>4</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>TIM16_CH1 input</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>LSI</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>LSE</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>RTC wakeup</description>
					  <value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x4</name>
					  <description>MCO2</description>
					  <value>0x4</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
