KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32U031.svd
        </registers>
      </peripheral>
	  <peripheral derivedFrom="USART1">
        <name>USART2</name>
        <baseAddress>0x40004400</baseAddress>
		<interrupt>
          <name>USART2_LPUART2</name>
          <description>USART2 and LPUART2 global interrupt (combined with EXTI lines 26 and 35)</description>
          <value>28</value>
        </interrupt>
      </peripheral>
	  <peripheral derivedFrom="USART1">
        <name>USART3</name>
        <baseAddress>0x40004800</baseAddress>
		<interrupt>
          <name>USART3_LPUART1</name>
          <description>USART3 and LPUART1 global interrupt (combined with EXTI lines 24 and 28)</description>
          <value>29</value>
        </interrupt>
      </peripheral>
	  <peripheral derivedFrom="USART1">
        <name>USART4</name>
        <baseAddress>0x40004C00</baseAddress>		
		<interrupt>
          <name>USART4</name>
          <description>USART4 global interrupt (combined with EXTI lines 20 and 34)</description>
          <value>30</value>
        </interrupt>
      </peripheral>
	  <peripheral>
        <name>VREFBUF</name>
        <description>VREFBUF address block description</description>
		<groupName>VREFBUF</groupName>
        <baseAddress>0x40010030</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x8</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>VREFBUF_CSR</name>
            <displayName>VREFBUF_CSR</displayName>
            <description>VREFBUF control and status register</description>
            <addressOffset>0x00</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENVR</name>
                <description>Voltage reference buffer mode enable
This bit is used to enable the voltage reference buffer mode.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Internal voltage reference mode disable (external voltage reference mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Internal voltage reference mode (reference buffer enable or hold mode) enable.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HIZ</name>
                <description>High impedance mode
This bit controls the analog switch to connect or not the V&lt;sub&gt;REF+&lt;/sub&gt; pin.
Refer to Table172: VREF buffer modes for the mode descriptions depending on ENVR bit configuration.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>V&lt;sub&gt;REF+&lt;/sub&gt; pin is internally connected to the voltage reference buffer output.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>V&lt;sub&gt;REF+&lt;/sub&gt; pin is high impedance.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VRS</name>
                <description>Voltage reference scale
This bit selects the value generated by the voltage reference buffer.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Voltage reference set to V&lt;sub&gt;REF_OUT1&lt;/sub&gt; (around 2.0481V).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Voltage reference set to V&lt;sub&gt;REF_OUT2&lt;/sub&gt; (around 2.51V).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VRR</name>
                <description>Voltage reference buffer ready</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>the voltage reference buffer output is not ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>the voltage reference buffer output reached the requested level.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VREFBUF_CCR</name>
            <displayName>VREFBUF_CCR</displayName>
            <description>VREFBUF calibration control register</description>
            <addressOffset>0x04</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFF00</resetMask>
            <fields>
              <field>
                <name>TRIM</name>
                <description>None</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
